# IsSurfaceToleranceSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJExportOptions..::..IsSurfaceToleranceSet Method
OBJExportOptions Class See Also
---
Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsSurfaceToleranceSet()
```

Visual Basic
---
```text
Public Function IsSurfaceToleranceSet As Boolean
```

Visual C++
---
```text
public:
bool IsSurfaceToleranceSet()
```

# ### Return Value
True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.
# See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace